{
  "activation_function": "relu",
  "architectures": [
    "Mask2FormerForUniversalSegmentation"
  ],
  "backbone": null,
  "backbone_config": {
    "attention_probs_dropout_prob": 0.0,
    "depths": [
      2,
      2,
      18,
      2
    ],
    "drop_path_rate": 0.3,
    "embed_dim": 128,
    "encoder_stride": 32,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 1024,
    "image_size": 224,
    "initializer_range": 0.02,
    "layer_norm_eps": 1e-05,
    "mlp_ratio": 4.0,
    "model_type": "swin",
    "num_channels": 3,
    "num_heads": [
      4,
      8,
      16,
      32
    ],
    "num_layers": 4,
    "out_features": [
      "stage1",
      "stage2",
      "stage3",
      "stage4"
    ],
    "out_indices": [
      1,
      2,
      3,
      4
    ],
    "patch_size": 4,
    "path_norm": true,
    "qkv_bias": true,
    "stage_names": [
      "stem",
      "stage1",
      "stage2",
      "stage3",
      "stage4"
    ],
    "use_absolute_embeddings": false,
    "window_size": 12
  },
  "backbone_kwargs": null,
  "class_weight": 2.0,
  "common_stride": 4,
  "decoder_layers": 10,
  "dice_weight": 5.0,
  "dim_feedforward": 2048,
  "dropout": 0.0,
  "dtype": "float32",
  "encoder_feedforward_dim": 1024,
  "encoder_layers": 6,
  "enforce_input_proj": false,
  "enforce_input_projection": false,
  "feature_size": 256,
  "feature_strides": [
    4,
    8,
    16,
    32
  ],
  "hidden_dim": 256,
  "id2label": {
    "0": "Background",
    "1": "road",
    "2": "sidewalk",
    "3": "construction",
    "4": "tram-track",
    "5": "fence",
    "6": "pole",
    "7": "traffic-light",
    "8": "traffic-sign",
    "9": "vegetation",
    "10": "terrain",
    "11": "sky",
    "12": "human",
    "13": "rail-track",
    "14": "car",
    "15": "truck",
    "16": "trackbed",
    "17": "on-rails",
    "18": "rail-raised",
    "19": "rail-embedded"
  },
  "ignore_value": 255,
  "importance_sample_ratio": 0.75,
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "label2id": {
    "Background": 0,
    "car": 14,
    "construction": 3,
    "fence": 5,
    "human": 12,
    "on-rails": 17,
    "pole": 6,
    "rail-embedded": 19,
    "rail-raised": 18,
    "rail-track": 13,
    "road": 1,
    "sidewalk": 2,
    "sky": 11,
    "terrain": 10,
    "trackbed": 16,
    "traffic-light": 7,
    "traffic-sign": 8,
    "tram-track": 4,
    "truck": 15,
    "vegetation": 9
  },
  "mask_feature_size": 256,
  "mask_weight": 5.0,
  "model_type": "mask2former",
  "no_object_weight": 0.1,
  "num_attention_heads": 8,
  "num_hidden_layers": 10,
  "num_queries": 100,
  "output_auxiliary_logits": null,
  "oversample_ratio": 3.0,
  "pre_norm": false,
  "train_num_points": 12544,
  "transformers_version": "4.56.2",
  "use_auxiliary_loss": true,
  "use_pretrained_backbone": false,
  "use_timm_backbone": false
}
